//
//  Format.swift
//  EmojiRPG
//
//  Created by Suisei killfaeh on 28/12/2024.
//

import Foundation

let 🔣 =
[
    "a": "ªÁáÀàĂăẮắẰằẴẵẲẳÂâẤấẦầẪẫẨẩǍǎÅåǺǻÄäÃãĄąĀāẢảȀȁȂȃẠạẶặẬậḀḁȺ",
    "ae": "ÆæǼǽẚ",
    "b": "ḂḃḄḅḆḇ",
    "c": "ĆćĈĉČčĊċÇçḈḉȻȼ",
    "d": "ĎďḊḋḐḑḌḍḒḓḎḏĐđÐð",
    "dz": "ǱǲǳǄǅǆ",
    "e": "ÉéÈèĔĕÊêẾếỀềỄễỂểĚěËëẼẽĖėȨȩḜḝĘęĒēḖḗḔḕẺẻȄȅȆȇẸẹỆệḘḙḚḛ",
    "f": "Ḟḟƒ",
    "g": "ǴǵĞğĜĝĠġĢģḠḡ",
    "h": "ĤĥḦḧḢḣḨḩḤḥḪḫẖĦħ",
    "i": "ÍíÌìĬĭÎîǏǐÏïḮḯĨĩİĮįĪīỈỉȈȉȊȋỊịḬḭı",
    "ij": "Ĳĳ",
    "j": "Ĵĵ",
    "k": "ḰḱĶķḲḳḴḵ",
    "l": "ĹĺĽľĻļḶḷḸḹḼḽḺḻŁłĿŀȽ",
    "lj": "Ǉǈǉ",
    "m": "ḾḿṀṁṂṃ",
    "n": "ŃńǸǹŇňÑñṄṅŅņṆṇṊṋṈṉ",
    "nj": "Ǌǋǌ",
    "o": "ºÓóÒòŎŏÔôỐốỒồỖỗỔổǑǒÖöȪȫŐőÕõṌṍṎṏȬȭȮȯȰȱØøǾǿŌōṒṓṐṑỎỏȌȍȎȏƠơỚớỜờỠỡỞởỢợỌọỘộ",
    "oe": "Œœ",
    "p": "ṔṕṖṗ",
    "r": "ŔŕŘřṘṙŖŗȐȑȒȓṚṛṜṝṞṟ",
    "s": "ŚśṤṥŜŝŠšṦṧṠṡŞşṢṣṨṩȘșſẛȿ",
    "ss": "ßẞ",
    "t": "ŤťẗṪṫŢţṬṭȚțṰṱṮṯŦŧȾ",
    "u": "ÚúÙùŬŭÛûǓǔŮůÜüǗǘǛǜǙǚǕǖŰűŨũṸṹŲųŪūṺṻỦủȔȕȖȗƯưỨứỪừỮữỬửỰựỤụṲṳṶṷṴṵ",
    "v": "ṼṽṾṿ",
    "w": "ẂẃẀẁŴŵẘẄẅẆẇẈẉ",
    "x": "ẌẍẊẋ",
    "y": "ÝýỲỳŶŷẙÿŸỸỹẎẏȲȳỶỷỴỵ",
    "z": "ŹźẐẑŽžŻżẒẓẔẕɀ",
    "th": "Þþ"
]

let letters = Array("ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz")
let 𝓁ℯ𝓉𝓉ℯ𝓇𝓈 = Array("𝒜ℬ𝒞𝒟ℰℱ𝒢ℋℐ𝒥𝒦ℒℳ𝒩𝒪𝒫𝒬ℛ𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵𝒶𝒷𝒸𝒹ℯ𝒻ℊ𝒽𝒾𝒿𝓀𝓁𝓂𝓃ℴ𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏")
let 𝓵𝓮𝓽𝓽𝓮𝓻𝓼 = Array("𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃")
let 𝔩𝔢𝔱𝔱𝔢𝔯𝔰 = Array("𝔄𝔅ℭ𝔇𝔈𝔉𝔊ℌℑ𝔍𝔎𝔏𝔐𝔑𝔒𝔓𝔔ℜ𝔖𝔗𝔘𝔙𝔚𝔛𝔜ℨ𝔞𝔟𝔠𝔡𝔢𝔣𝔤𝔥𝔦𝔧𝔨𝔩𝔪𝔫𝔬𝔭𝔮𝔯𝔰𝔱𝔲𝔳𝔴𝔵𝔶𝔷")
let 𝖑𝖊𝖙𝖙𝖊𝖗𝖘 = Array("𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟")

func 🧽🔣(_ 📖: String) -> String
{
    var 📤 = 📖
    
    for (🔑, 🔤) in 🔣
    {
        let 🔤🔤 = Array(🔤)
        
        for 👆 in 0..<🔤🔤.count
        {
            📤 = 📤.replacingOccurrences(of: String(🔤🔤[👆]), with: 🔑)
        }
    }
    
    return 📤
}

func 👉𝓵𝓮𝓽𝓽𝓮𝓻𝓼(_ 📖: String) -> String
{
    var 📤 = 🧽🔣(📖)
    
    for 👆 in 0..<letters.count
    {
        📤 = 📤.replacingOccurrences(of: String(letters[👆]), with: String(𝓵𝓮𝓽𝓽𝓮𝓻𝓼[👆]))
    }
    
    return 📤
}

func 👉𝖑𝖊𝖙𝖙𝖊𝖗𝖘(_ 📖: String) -> String
{
    var 📤 = 🧽🔣(📖)
    
    for 👆 in 0..<letters.count
    {
        📤 = 📤.replacingOccurrences(of: String(letters[👆]), with: String(𝖑𝖊𝖙𝖙𝖊𝖗𝖘[👆]))
    }
    
    return 📤
}

func 🛠️💨(_ 📏: Int) -> String
{
    var 📤 = 🫙
    for _ in 0..<📏
    {
        📤 = 📤 + 💨 + 🪂
    }
    
    return 📤
}

func 🧽🎨(_ 📖: String) -> String
{
    let 📤 = 📖
    return 📤
}

func 💥📖(_ 📖: String, _ 📏: Int) -> [String]
{
    let 📖📖 = 📖.components(separatedBy: ["\n"])
    var 📤📖📖: [String] = []
    
    for 👆 in 0..<📖📖.count
    {
        let 📝📝 = 📖📖[👆].components(separatedBy: [" "])
        var 📝 = 🫙
        
        for 🖕 in 0..<📝📝.count
        {
            let 🗒️ = 📝 + 📝📝[🖕]
            
            if 🧽🎨(🗒️).count <= 📏
            {
                📝 = 📝 + 📝📝[🖕]
                
                if 🧽🎨(📝).count <= 📏
                {
                    📝 = 📝 + 💨
                }
            }
            else
            {
                📤📖📖.append(📝)
                📝 = 📝📝[🖕] + 💨
            }
            
            if 🖕 >= 📝📝.count-1
            {
                📤📖📖.append(📝)
            }
        }
    }
    
    return 📤📖📖
}

func 📝🫷(_ 📝: String, _ 🔤: String, _ 📏: Int, _ 🎨👉: String, _ 👈🎨: String) -> String
{
    var 📤📝 = 🫙
    
    for _ in 0..<📏
    {
        📤📝 = 📤📝 + 🔤
    }
    
    📤📝 = 📤📝 + 🎨👉 + 📝 + 👈🎨
    
    return 📤📝
}

func 📝🫷🫷(_ 📝: String, _ 🔤: String, _ 📏: Int, _ 🎨👉: String, _ 👈🎨: String) -> String
{
    var 📤📝 = 🎨👉 + 📝 + 👈🎨
    let 🫰🔤 = 📏 - 🧽🎨(📝).count
    
    if 🫰🔤 > 0 && 🔤 != 💨
    {
        for _ in 0..<🫰🔤
        {
            📤📝 = 📤📝 + 🔤
        }
    }
    
    return 📤📝
}

func 🫸📝(_ 📝: String, _ 🔤: String, _ 📏: Int, _ 🎨👉: String, _ 👈🎨: String) -> String
{
    var 📤📝 = 🎨👉 + 📝 + 👈🎨
    let 🫰🔤 = 📏 - 🧽🎨(📝).count
    
    if 🫰🔤 > 0
    {
        for _ in 0..<🫰🔤
        {
            📤📝 = 🔤 + 📤📝
        }
    }
    
    return 📤📝
}

func 🫸📝🫷(_ 📝: String, _ 🔤: String, _ 📏: Int, _ 🎨👉: String, _ 👈🎨: String) -> String
{
    var 📤📝 = 🎨👉 + 📝 + 👈🎨
    let 🫰🔤 = 📏 - 🧽🎨(📝).count
    
    if 🫰🔤 > 0
    {
        for 👆 in 0..<🫰🔤
        {
            if 👆%2 == 0
            {
                if 🔤 != 💨
                {
                    📤📝 = 📤📝 + 🔤
                }
            }
            else
            {
                📤📝 = 🔤 + 📤📝
            }
        }
    }
    
    return 📤📝
}

func 🛠️🏴(_ 📏: Int) -> [String]
{
    var 📤:[String] = []
    
    for _ in 0..<📏
    {
        📤.append("⬛️")
    }
    
    return 📤
}

func 💥📝(_ 📝: String) -> [String]
{
    var 📤:[String] = []
    let 📝📝 = Array(📝)
    
    for 👆 in 0...📝📝.count/2
    {
        if 2*👆 < 📝📝.count
        {
            var 🔠 = String(📝📝[2*👆])
            
            if 2*👆+1 < 📝📝.count
            {
                🔠 = 🔠 + String(📝📝[2*👆+1])
            }
            else
            {
                🔠 = 🔠 + 💨
            }
            
            📤.append(🔠)
        }
    }
    
    return 📤
}

func 🫸🏴🫷(_ 📝: [String], _ 📏: Int) -> [String]
{
    var 📤📝: [String] = []
    //var 👉: [String] = []
    var 👈: [String] = []
    let 🫰🔤 = 📏 - 📝.count
    
    if 🫰🔤 > 0
    {
        for 👆 in 0..<🫰🔤
        {
            if 👆%2 == 0
            {
                📤📝.append("⬛️")
            }
            else
            {
                👈.append("⬛️")
            }
        }
    }
    
    for 👆 in 0..<📝.count
    {
        📤📝.append(📝[👆])
    }
    
    for 👆 in 0..<👈.count
    {
        📤📝.append(👈[👆])
    }
    
    return 📤📝
}
