//
//  Mapping.swift
//  EmojiRPG
//
//  Created by Suisei killfaeh on 27/12/2024.
//

import Foundation
import CoreImage

let 🖥️📏 = [38,24]

class 🌍🧩
{
    var 🏷️ = "🌍🧩"
    var 🏞️ = 🟩
    var 🏕️ = 💨+💨
    var 🚷 = 👎
    var 🎞️ = 👎
    var 👉🎞️ = 👍
    
    init(_ 🏞️: String, _ 🏕️: String)
    {
        self.🏞️ = 🏞️
        self.🏕️ = 🏕️
    }
    
    func 🎲🎞️👉🖥️()
    {
        if 🎞️ == 👍
        {
            if Int.random(in: 0...1) < 1
            {
                👉🎞️ = 👍
            }
            else
            {
                👉🎞️ = 👎
            }
        }
    }
    
    func 👉🖥️() -> String
    {
        var 📤 = 🏞️ + 🏕️ + 🟫
        
        if 🎞️ == 👍 && 👉🎞️
        {
            📤 = 🏞️ + 💨 + 💨 + 🟫
        }
        
        return 📤
    }
    
    func 👉💾() -> [Any]
    {
        let 🗂️: [Any] = [ 🏷️, 🏞️, 🏕️, 🚷, 🎞️ ]
        return 🗂️
    }
}

class 🌍🧩🚷: 🌍🧩
{
    override init(_ 🏞️: String, _ 🏕️: String)
    {
        super.init(🏞️, 🏕️)
        🚷 = 👍
    }
}

class 🌊: 🌍🧩🚷
{
    var 👆 = 0
    var 🖕 = 0
    var 🎞️👆 = 0
    
    override func 🎲🎞️👉🖥️()
    {
        if 🎞️👆%3 == 0
        {
            if (🖕%2 == 0 && 👆%3 == 0) || (🖕%2 != 0 && 👆%3 != 0)
            {
                👉🎞️ = 👍
            }
            else if (🖕%2 == 0 && 👆%3 != 0) || (🖕%2 != 0 && 👆%3 == 0)
            {
                👉🎞️ = 👎
            }
        }
        else if 🎞️👆%3 == 1
        {
            if (🖕%2 == 0 && 👆%3 == 1) || (🖕%2 != 0 && 👆%3 != 1)
            {
                👉🎞️ = 👍
            }
            else if (🖕%2 == 0 && 👆%3 != 1) || (🖕%2 != 0 && 👆%3 == 1)
            {
                👉🎞️ = 👎
            }
        }
        else if 🎞️👆%3 == 2
        {
            if (🖕%2 == 0 && 👆%3 == 2) || (🖕%2 != 0 && 👆%3 != 2)
            {
                👉🎞️ = 👍
            }
            else if (🖕%2 == 0 && 👆%3 != 2) || (🖕%2 != 0 && 👆%3 == 2)
            {
                👉🎞️ = 👎
            }
        }
        
        🎞️👆 += 1
    }
    
    override init(_ 🏞️: String, _ 🏕️: String)
    {
        super.init(🏞️, 🏕️)
        🎞️ = 👍
    }
}

class 🌍
{
    internal var 🌍🧩🧩🧩: [[🌍🧩]] = []
    internal var 🗂️🗂️🗂️: [[[Any]]] = []
    private var 🏷️ = "world"
    private let 🧷 = "bmp"
    private var 🌍📁: String
    var 🔄 = 👎
    var 🧮🏗️ = 0
    var 🧮💾 = 0
    var 🧮🎞️ = 0
    
    var 📏📏🏗️ = DispatchQueue(label: "🏗️")
    var 📏📏💾 = DispatchQueue(label: "💾")
    var 📏📏🎞️ = DispatchQueue(label: "🎞️")
    
    var 🗺️📏: Int
    {
        get
        {
            return 🌍🧩🧩🧩.count
        }
    }
    
    var 🗺️📐: Int
    {
        get
        {
            return 🌍🧩🧩🧩[0].count
        }
    }
    
    init()
    {
        🌍📁 = "Resources/maps/" + 🏷️ + "." + 🧷
    }
    
    private func 💾🏗️()
    {
        let 🖼️ = 🖼️🗺️(🌍📁)
        🖼️.🏗️()
    }
    
    func 🏗️()
    {        
        🌍📁 = 🔍📁("maps", 🏷️, 🧷)
        💾🏗️()
    }
    
    func 🏗️👆(_ 👆: Int, _ 🗂️🗂️: [[Any]])
    {
        📏📏🏗️.async
        {
            var 🖕 = 0
            
            for 🗂️ in 🗂️🗂️
            {
                var 🧩 = 🌍🧩(🫙, 🫙)
                    
                if let 🏷️: String = 🗂️[0] as? String
                {
                    🧩.🏷️ =  🏷️
                }
                    
                if let 🏷️: String = 🗂️[1] as? String
                {
                    🧩.🏞️ =  🏷️
                        
                    if 🏷️ == "\u{001B}[48;5;21m" || 🏷️ == "\u{001B}[48;5;39m"
                    {
                        let 🌊🧩 = 🌊(🏷️, 🫙)
                        🌊🧩.👆 = 🖕
                        🌊🧩.🖕 = 👆
                        🧩 = 🌊🧩
                    }
                }
                    
                if let 🏷️: String = 🗂️[2] as? String
                {
                    🧩.🏕️ =  🏷️
                }
                    
                if let 🏷️: Bool = 🗂️[3] as? Bool
                {
                    🧩.🚷 =  🏷️
                }
                    
                if let 🏷️: Bool = 🗂️[4] as? Bool
                {
                    🧩.🎞️ =  🏷️
                }
                    
                self.🌍🧩🧩🧩[👆][🖕] = 🧩
                
                🖕 += 1
            }
            
            self.🧮🏗️ += 1
        }
    }
    
    func 🏗️(_ 🗂️🗂️🗂️: [[[Any]]])
    {
        📏📏🏗️ = DispatchQueue(label: "🏗️")
        
        🌍🧩🧩🧩 = []
        
        for 👆 in 0..<🗂️🗂️🗂️.count
        {
            let 🌍🧩🧩 = [🌍🧩](repeating: 🌍🧩(🫙, 🫙), count: 🗂️🗂️🗂️[👆].count)
            🌍🧩🧩🧩.append(🌍🧩🧩)
        }
        
        var 👆 = 0
        🧮🏗️ = 0
        
        for 🗂️🗂️ in 🗂️🗂️🗂️
        {
            🏗️👆(👆, 🗂️🗂️)
            👆 += 1
        }
        
        while 🧮🏗️ < 🗂️🗂️🗂️.count
        {
            👩‍🦽🫙()
        }
    }
    
    func 👉🖥️(_ 📏: Int, _ 📐: Int, _ 🎭🎭: [[String]]) -> String
    {
        var 📤 = 🫙
        
        var 📍📏 = 📏 - 🖥️📏[0]/2
        var 📍📐 = 📐 - 🖥️📏[1]/2
        
        if 🔄 == 👎
        {
            if 📍📏 < 0
            {
                📍📏 = 0
            }
            else if 📍📏 + 🖥️📏[0] > 🌍🧩🧩🧩[0].count
            {
                📍📏 = 🌍🧩🧩🧩[0].count - 🖥️📏[0]
            }
            
            if 📍📐 < 0
            {
                📍📐 = 0
            }
            else if 📍📐 + 🖥️📏[1] > 🌍🧩🧩🧩.count
            {
                📍📐 = 🌍🧩🧩🧩.count - 🖥️📏[1]
            }
        }
        
        for 👆 in 0..<🖥️📏[1]
        {
            var 📌📐 = 📍📐 + 👆
            
            if  🔄 == 👍
            {
                if 📌📐 < 0
                {
                    📌📐 = 🌍🧩🧩🧩.count + 📌📐
                }
                else if 📌📐 >= 🌍🧩🧩🧩.count
                {
                    📌📐 = 📌📐 - 🌍🧩🧩🧩.count
                }
            }
            
            let 🌍🧩🧩 = 🌍🧩🧩🧩[📌📐]
            
            if 👆 > 0
            {
                📤 = 📤 + 🪂
            }
            
            📤 = 📤 + 💨 + 💨
            
            for 🖕 in 0..<🖥️📏[0]
            {
                var 📌📏 = 📍📏 + 🖕
                
                if  🔄 == 👍
                {
                    if 📌📏 < 0
                    {
                        📌📏 = 🌍🧩🧩.count + 📌📏
                    }
                    else if 📌📏 >= 🌍🧩🧩.count
                    {
                        📌📏 = 📌📏 - 🌍🧩🧩.count
                    }
                }
                
                let 🔠 = 🎭🎭[👆][🖕]
                
                if 🔠 == "⬛️"
                {
                    📤 = 📤 + 🌍🧩🧩[📌📏].👉🖥️()
                }
                else
                {
                    📤 = 📤 + 🔠
                }
            }
        }
        
        return 📤
    }
    
    func 👉💾👆(_ 👆: Int)
    {
        📏📏💾.async
        {
            for 🖕 in 0..<self.🌍🧩🧩🧩[👆].count
            {
                self.🗂️🗂️🗂️[👆][🖕] = self.🌍🧩🧩🧩[👆][🖕].👉💾()
            }
            
            self.🧮💾 += 1
        }
    }
    
    func 👉💾() -> [[[Any]]]
    {
        📏📏💾 = DispatchQueue(label: "💾")
        
        🗂️🗂️🗂️ = []
        🧮💾 = 0
        
        for 👆 in 0..<🌍🧩🧩🧩.count
        {
            let 🗂️🗂️ = [[Any]](repeating: [], count: 🌍🧩🧩🧩[👆].count)
            🗂️🗂️🗂️.append(🗂️🗂️)
        }
        
        for 👆 in 0..<🌍🧩🧩🧩.count
        {
            👉💾👆(👆)
        }
        
        while 🧮💾 < 🌍🧩🧩🧩.count
        {
            👩‍🦽🫙()
        }
        
        return 🗂️🗂️🗂️
    }
    
    func 🔲🚷(_ 👆: Int, _ 🖕: Int) -> Bool
    {
        var 👆👆 = 👆
        var 🖕🖕 = 🖕
        
        if 👆 < 0
        {
            👆👆 = 🌍🧩🧩🧩[0].count-1
        }
        else if 👆 >= 🌍🧩🧩🧩[0].count
        {
            👆👆 = 0
        }
        
        if 🖕 < 0
        {
            🖕🖕 = 🌍🧩🧩🧩.count-1
        }
        else if 🖕 >= 🌍🧩🧩🧩.count
        {
            🖕🖕 = 0
        }
        
        return 🌍🧩🧩🧩[🖕🖕][👆👆].🚷
    }
    
    func 🎲🎞️👉🖥️()
    {
        for 🌍🧩🧩 in 🌍🧩🧩🧩
        {
            for 🧩 in 🌍🧩🧩
            {
                if let 🌊🧩 = 🧩 as? 🌊
                {
                    🌊🧩.🎲🎞️👉🖥️()
                }
            }
        }
    }
}

class 🎲🌍: 🌍
{
    var 📏 = 40
    var 📐 = 24
    var 🏔️🗺️🗺️ = 🎲🗺️()
    
    var 🧮🎲 = 0
    var 📏📏🎲 = DispatchQueue(label: "🎲")
    
    let 🎨🎨 =
    [
        "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m", "\u{001B}[48;5;21m",
        "\u{001B}[48;5;39m",
        "\u{001B}[48;5;51m",
        
        "\u{001B}[48;5;229m",
        "\u{001B}[48;5;221m",
        
        "\u{001B}[48;5;154m", "\u{001B}[48;5;154m",
        "\u{001B}[48;5;82m", "\u{001B}[48;5;82m", "\u{001B}[48;5;82m", "\u{001B}[48;5;82m", "\u{001B}[48;5;82m",
        "\u{001B}[48;5;40m", "\u{001B}[48;5;40m", "\u{001B}[48;5;40m", "\u{001B}[48;5;40m", "\u{001B}[48;5;40m",
        "\u{001B}[48;5;76m",
        
        "\u{001B}[48;5;142m",
        
        "\u{001B}[48;5;145m", "\u{001B}[48;5;145m", "\u{001B}[48;5;145m",
        "\u{001B}[48;5;254m", "\u{001B}[48;5;254m", "\u{001B}[48;5;254m",
        "\u{001B}[48;5;15m", "\u{001B}[48;5;15m", "\u{001B}[48;5;15m"
    ]
    
    let 🎨🏕️🏕️ =
    [
        "\u{001B}[48;5;21m": [ "🌊" ],
        "\u{001B}[48;5;39m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌊", "🌊", "🌊", "🌊", "🌊"],
        "\u{001B}[48;5;51m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🏝️" + 💨 ],
        
        "\u{001B}[48;5;229m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌴" ],
        "\u{001B}[48;5;221m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌾", "🌴", "🌵", "🌵" ],
        
        "\u{001B}[48;5;154m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌾", "🌳", "🌴" ],
        "\u{001B}[48;5;82m" : [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 
                                💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🍄",  "🌱",
                                "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", 
                                "🌲", "🌲", "🌲", "🌲", "🌲", "🌲" ],
        "\u{001B}[48;5;40m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨,
                               💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🍄", "🌿",
                               "🌳", "🌳", "🌳", "🌳", "🌳", "🌳", 
                               "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲" ],
        "\u{001B}[48;5;76m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌲", "🌲" ],
        
        "\u{001B}[48;5;142m": [ 💨 + 💨, 💨 + 💨, 💨 + 💨, 💨 + 💨, "🌲", "🌲", "⛰️" + 💨 ],
        
        "\u{001B}[48;5;145m": [ 💨 + 💨, "⛰️" + 💨, "⛰️" + 💨, "⛰️" + 💨, "⛰️" + 💨 ],
        "\u{001B}[48;5;254m": [ 💨 + 💨, "⛰️" + 💨, "⛰️" + 💨, "⛰️" + 💨, "⛰️" + 💨, "🏔️" + 💨, "🏔️" + 💨, "🏔️" + 💨, "🏔️" + 💨 ],
        "\u{001B}[48;5;15m": [ "🏔️" + 💨, "🗻" ]
    ]
    
    init(_ 📏: Int, _ 📐: Int)
    {
        super.init()
        self.📏 = 📏
        self.📐 = 📐
        🔄 = 👍
    }
    
    func 🛠️🏔️🗺️() -> [[Double]]
    {
        let 🔲🎼 = 5
        let 🔲🏔️📏🏔️ = 2
        
        if 📏%Int(pow(2.0, Double(🔲🎼))) != 0
        {
            let 📌 = Int(Double(📏)/pow(2.0, Double(🔲🎼))) * Int(pow(2.0, Double(🔲🎼)))
            📏 = 📌*🔲🏔️📏🏔️
        }
        
        if 📐%Int(pow(2.0, Double(🔲🎼))) != 0
        {
            let 📌 = Int(Double(📐)/pow(2.0, Double(🔲🎼))) * Int(pow(2.0, Double(🔲🎼)))
            📐 = 📌*🔲🏔️📏🏔️
        }
        
        🏔️🗺️🗺️ = 🎲🗺️()
        🏔️🗺️🗺️.🔲🎼 = 🔲🎼
        🏔️🗺️🗺️.🪨 = 0.75
        🏔️🗺️🗺️.🔲📏 = 📏/Int(pow(2.0, Double(🔲🎼))) + 1
        🏔️🗺️🗺️.🔲📐 = 📐/Int(pow(2.0, Double(🔲🎼))) + 1
        🏔️🗺️🗺️.🔲🏔️📏🏔️ = 🔲🏔️📏🏔️ * Int(pow(2.0, Double(🔲🎼)))
        🏔️🗺️🗺️.🛠️🎲🗺️()
        🏔️🗺️🗺️.🛠️🏔️📏🏔️()
        
        return 🏔️🗺️🗺️.🏔️📏🏔️🗺️
    }
    
    func 🛫👆(_ 👆: Int, _ 🎲🗺️🗺️📏: [Double])
    {
        📏📏🎲.async
        {
            for 🖕 in 0..<🎲🗺️🗺️📏.count
            {
                let 🏔️📏 = Int(Double(self.🎨🎨.count-1) * 🎲🗺️🗺️📏[🖕])
                let 🎨 = self.🎨🎨[🏔️📏]
                var 🏕️ = 💨 + 💨
                
                if let 🎨🏕️ = self.🎨🏕️🏕️[🎨]
                {
                    if 🎨🏕️.count > 0
                    {
                        🏕️ = 🎨🏕️[Int.random(in: 0..<🎨🏕️.count)]
                    }
                }
                
                var 🧩 = 🌍🧩(🎨, 🏕️)
                
                if 🎨 == "\u{001B}[48;5;21m" || 🎨 == "\u{001B}[48;5;39m"
                {
                    let 🌊🧩 = 🌊(🎨, 🏕️)
                    🌊🧩.👆 = 🖕
                    🌊🧩.🖕 = 👆
                    🧩 = 🌊🧩
                }
                else if 🎨 == "\u{001B}[48;5;51m" || 🎨 == "\u{001B}[48;5;15m"
                {
                    🧩.🚷 = 👍
                }
                
                self.🌍🧩🧩🧩[👆][🖕] = 🧩
            }
            
            self.🧮🎲 += 1
        }
    }
    
    func 🛫()
    {
        let 🎲🗺️🗺️ = 🛠️🏔️🗺️()
        
        🧮🎲 = 0
        📏📏🎲 = DispatchQueue(label: "🎲")
        
        🌍🧩🧩🧩 = []
        
        for 👆 in 0..<🎲🗺️🗺️.count
        {
            let 🌍🧩🧩 = [🌍🧩](repeating: 🌍🧩(🫙, 🫙), count: 🎲🗺️🗺️[👆].count)
            🌍🧩🧩🧩.append(🌍🧩🧩)
        }
        
        for 👆 in 0..<🎲🗺️🗺️.count
        {
            🛫👆(👆, 🎲🗺️🗺️[👆])
        }
        
        while 🧮🎲 < 🎲🗺️🗺️.count
        {
            👩‍🦽🫙()
        }
    }
}
