//
//  Engine.swift
//  EmojiRPG
//
//  Created by Suisei killfaeh on 27/12/2024.
//

import Foundation

enum 🎚️🎚️
{
   case 📱🏠, 📱, 🎛️👅, 📱🗄️, 📱👤, 📱👤🎨, 📱👤🏷️, 🎲🖥️
}

class 🚜
{
    static var 🎚️ = 🎚️🎚️.📱🏠
    static var 📱📱 = 👉🖥️(🫙, [], 🫙)
    static var 📱📱🗄️ = 𝌮👉🖥️(🫙, [], 3, 🫙, 👎)
    static var 📱🎛️👅 = 👉🖥️(🫙, [], 🫙)
    static var 📱📱👤 = 𝌮👉🖥️(🫙, [], 5, 🫙, 👍)
    static var 📱📱👤🎨 = 𝌮👉🖥️(🫙, [], 5, 🫙, 👍)
    
    static func 🛫()
    {
        🏠🚜.🛫()
    }
    
    static func 🛫📱()
    {
        let 📱📱📱 =
        [
            [ "🏷️": "🛠️🎲", "🪧": 🏗️📝("🛠️🎲") ],
            [ "🏷️": "🏗️🎲", "🪧": 🏗️📝("🏗️🎲") ],
            [ "🏷️": "🛠️", "🪧": 🏗️📝("🛠️") ],
            [ "🏷️": "👉🚪", "🪧": 🏗️📝("👉🚪")]
        ]
        
        📱📱 = 👉🖥️(👉𝓵𝓮𝓽𝓽𝓮𝓻𝓼("Emoji  RPG"), 📱📱📱, "🛠️🎲")
    }
    
    static func 🛫📱👤()
    {
        var 👥👥: [[String: String]] = []
        
        for 👤 in 👥
        {
            👥👥.append([ "🏷️": 👤, "🪧": 👤 + 💨])
        }
        
        📱📱👤 = 𝌮👉🖥️(🏗️📝("👉👤"), 👥👥, 5, 👥[0], 👍)
    }
    
    static func 🛫📱👤🎨()
    {
        var 🎨🎨: [[String: String]] = []
        
        if let 👤🎨🎨 = 👥🎨[🎲🚜.👤]
        {
            for 🎨 in 👤🎨🎨
            {
                🎨🎨.append([ "🏷️": 🎨, "🪧": 🎨 + 💨])
            }
            
            📱📱👤🎨 = 𝌮👉🖥️(🏗️📝("👉👤🎨"), 🎨🎨, 5, 👤🎨🎨[0], 👍)
        }
    }
    
    static func 🛫📱🗄️()
    {
        var 💾💾: [[String: String]] = []
        
        for 💾 in 1...15
        {
            var 🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🏗️📝("🫙") + 👈🪝
            
            if 🗄️.🏗️🏷️(💾-1) != 🫙
            {
                🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🗄️.🏗️🏷️(💾-1) + 👈🪝
            }
            
            💾💾.append([ "🏷️": "\(💾)", "🪧": 🏷️ ])
        }
        
        📱📱🗄️ = 𝌮👉🖥️(🏗️📝("🏗️🎲"), 💾💾, 3, "1", 👎)
    }
    
    static func 🛫🎛️👅()
    {
        📱🎛️👅 = 👉🖥️(🏗️📝("🎛️👅"), 👅👅, 🎛️.👅)
    }
    
    static func 👩‍🦽()
    {
        switch 🎚️
        {
            case .📱🏠:
                🏠🚜.👩‍🦽()
            case .🎲🖥️:
                🎲🚜.👩‍🦽()
            default:
                👩‍🦽🫙()
        }
    }
    
    static func 👉📚(_ 🔑: UInt8)
    {
        switch 🎚️
        {
            case .📱🏠:
                if 🎛️.🥛 == 👎
                {
                    🎚️ = 🎚️🎚️.🎛️👅
                    🛫🎛️👅()
                }
                else
                {
                    🎚️ = 🎚️🎚️.📱
                    🛫📱()
                }
            case .📱:
                if 🔑 == 10
                {
                    let 🎬 = 📱📱.🏗️()
                    
                    if 🎬 == "🛠️🎲"
                    {
                        🎚️ = 🎚️🎚️.📱👤
                        🛫📱👤()
                    }
                    else if 🎬 == "🏗️🎲"
                    {
                        🎚️ = 🎚️🎚️.📱🗄️
                        🛫📱🗄️()
                    }
                    else if 🎬 == "🛠️"
                    {
                        🎚️ = 🎚️🎚️.🎛️👅
                        🛫🎛️👅()
                    }
                    else if 🎬 == "👉🚪"
                    {
                        🎲👩‍🦽 = 👎
                        📨👉🖥️(🫙, 🏗️📝("👋"), 👎)
                    }
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱🏠
                }
                else
                {
                    📱📱.👉📚(🔑)
                }
            case .🎛️👅:
                if 🔑 == 10
                {
                    🎛️.👅 = 📱🎛️👅.🏗️()
                    🎛️.👉💾()
                    🎚️ = 🎚️🎚️.📱
                    🛫📱()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱
                    🛫📱()
                }
                else
                {
                    📱🎛️👅.👉📚(🔑)
                }
            case .📱🗄️:
                if 🔑 == 10
                {
                    let 🗄️👆 = 📱📱🗄️.🏗️()
                    let 🎁🗄️👆 = Int(🗄️👆)
                    
                    if let 🗄️👆👆 = 🎁🗄️👆
                    {
                        📨👉🖥️(🫙, 🏗️📝("🛠️🏗️🎲"), 👍)
                        🎲🚜.🏗️(🗄️👆👆)
                        🎚️ = 🎚️🎚️.🎲🖥️
                        🎲🚜.🎚️ = 🎚️🎚️🎲.🎲🌍
                    }
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱
                    🛫📱()
                }
                else
                {
                    📱📱🗄️.👉📚(🔑)
                }
            case .📱👤:
                if 🔑 == 10
                {
                    🎲🚜.👤 = 📱📱👤.🏗️()
                    🎚️ = 🎚️🎚️.📱👤🎨
                    🛫📱👤🎨()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱
                    🛫📱()
                }
                else
                {
                    📱📱👤.👉📚(🔑)
                }
            case .📱👤🎨:
                if 🔑 == 10
                {
                    🎲🚜.👤🎨 = 📱📱👤🎨.🏗️()
                    🎚️ = 🎚️🎚️.📱👤🏷️
                    🚜👤🏷️.🛫()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱👤
                    🛫📱👤()
                }
                else
                {
                    📱📱👤🎨.👉📚(🔑)
                }
            case .📱👤🏷️:
                if 🔑 == 10
                {
                    📨👉🖥️(🫙, 🏗️📝("🛠️🌍"), 👍)
                    🎲🚜.👤🏷️ = 🚜👤🏷️.🏷️
                    🎲🚜.🎲🛫()
                    🎚️ = 🎚️🎚️.🎲🖥️
                    🎲🚜.🎚️ = 🎚️🎚️🎲.🎲🌍
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️.📱👤🎨
                    🛫📱👤🎨()
                }
                else
                {
                    🚜👤🏷️.👉📚(🔑)
                }
            case .🎲🖥️:
                🎲🚜.👉📚(🔑)
        }
    }
}
