//
//  GameEngine.swift
//  EmojiRPG
//
//  Created by Suisei killfaeh on 27/12/2024.
//

import Foundation

enum 🎚️🎚️🎲
{
   case 🎲📱, 🎲📱💾, 🎲📱🗄️, 🎲🎛️👅, 🎲📱🚪👉, 🎲🌍, 🎲💬, 🎲🏬, 🎲🛠️, 🎲🛡️
}

class 🎲🚜
{
    static var 🎚️ = 🎚️🎚️🎲.🎲🌍
    
    static var 👤 = 👥[0]
    static var 👤🎨 = "👶🏻"
    static var 👤🏷️ = 🫙
    
    static var 🌍🌍 = 🎲🌍(40, 24)
    static var 👤🫵📏 = 0
    static var 👤🫵📐 = 0
    
    static var 📱📱 = 👉🖥️(🫙, [], 🫙)
    static var 📱📱💾 = 𝌮👉🖥️(🫙, [], 3, 🫙, 👎)
    static var 📱📱🗄️ = 𝌮👉🖥️(🫙, [], 3, 🫙, 👎)
    static var 📱🎛️👅 = 👉🖥️(🫙, [], 🫙)
    static var 📱🚪👉 = 👉🖥️(🫙, [], 🫙)
    
    static func 🎲🛫()
    {
        🌍🌍 = 🎲🌍(200, 200)
        🌍🌍.🛫()
        👤🫵📏 = Int.random(in: 0..<🌍🌍.📏)
        👤🫵📐 = Int.random(in: 0..<🌍🌍.📐)
        
        while 🌍🌍.🔲🚷(👤🫵📏, 👤🫵📐)
        {
            👤🫵📏 = Int.random(in: 0..<🌍🌍.📏)
            👤🫵📐 = Int.random(in: 0..<🌍🌍.📐)
        }
    }
    
    static func 🏗️(_ 👆: Int)
    {
        let 🗂️ = 🗄️.🏗️(👆-1)
        
        if let 🏷️: String = 🗂️["name"] as? String
        {
            👤🏷️ =  🏷️
        }
        
        if let 👤👤: String = 🗂️["face"] as? String
        {
            👤 =  👤👤
        }
        
        if let 🎨: String = 🗂️["faceColor"] as? String
        {
            👤🎨 =  🎨
        }
        
        if let 🫵📏: Int = 🗂️["x"] as? Int
        {
            👤🫵📏 =  🫵📏
        }
        
        if let 🫵📐: Int = 🗂️["y"] as? Int
        {
            👤🫵📐 =  🫵📐
        }
        
        if let 🌍🌍🌍: [[[Any]]] = 🗂️["map"] as? [[[Any]]]
        {
            🌍🌍.🏗️(🌍🌍🌍)
        }
        
        🎚️ = 🎚️🎚️🎲.🎲🌍
    }

    static func 📱🛫()
    {
        let 📱📱📱 =
        [
            [ "🏷️": "👉🎲", "🪧": 🏗️📝("👉🎲") ],
            [ "🏷️": "👉💾", "🪧": 🏗️📝("👉💾") ],
            [ "🏷️": "🏗️🎲", "🪧": 🏗️📝("🏗️🎲") ],
            [ "🏷️": "🛠️", "🪧": 🏗️📝("🛠️") ],
            [ "🏷️": "👉🚪", "🪧": 🏗️📝("👉🚪") ]
        ]
        
        📱📱 = 👉🖥️(🏗️📝("⏸️"), 📱📱📱, "👉🎲")
    }
    
    static func 🛫📱💾()
    {
        var 💾💾: [[String: String]] = []
        
        for 💾 in 1...15
        {
            var 🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🏗️📝("🫙") + 👈🪝
            
            if 🗄️.🏗️🏷️(💾-1) != 🫙
            {
                🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🗄️.🏗️🏷️(💾-1) + 👈🪝
            }
            
            💾💾.append([ "🏷️": "\(💾)", "🪧": 🏷️ ])
        }
        
        📱📱💾 = 𝌮👉🖥️(🏗️📝("👉💾"), 💾💾, 3, "1", 👎)
    }
    
    static func 🛫📱🗄️()
    {
        var 💾💾: [[String: String]] = []
        
        for 💾 in 1...15
        {
            var 🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🏗️📝("🫙") + 👈🪝
            
            if 🗄️.🏗️🏷️(💾-1) != 🫙
            {
                🏷️ = 🪝👉 + String(💾) + 💨 + ":" + 💨 + 🗄️.🏗️🏷️(💾-1) + 👈🪝
            }
            
            💾💾.append([ "🏷️": "\(💾)", "🪧": 🏷️ ])
        }
        
        📱📱🗄️ = 𝌮👉🖥️(🏗️📝("🏗️🎲"), 💾💾, 3, "1", 👎)
    }
    
    static func 🛫🎛️👅()
    {
        📱🎛️👅 = 👉🖥️(🏗️📝("🎛️👅"), 👅👅, 🎛️.👅)
    }
    
    static func 📱🚪👉🛫()
    {
        let 📱📱📱🚪👉 =
        [
            [ "🏷️": "👍", "🪧": 🏗️📝("👍") ],
            [ "🏷️": "👎", "🪧": 🏗️📝("👎") ]
        ]
        
        📱🚪👉 = 👉🖥️(🏗️📝("👉🚪❓"), 📱📱📱🚪👉, "👎")
    }
    
    static func 👩‍🦽()
    {
        switch 🎚️
        {
            case .🎲🌍:
                🌍🌍.🎲🎞️👉🖥️()
                🌍👉🖥️()
            default:
                👩‍🦽🫙()
        }
    }
    
    static func 👉📚(_ 🔑: UInt8)
    {
        switch 🎚️
        {
            case .🎲🌍:
                if 🔑 == 67 || 🔑 == 131
                {
                    👉𝌮()
                    🌍👉🖥️()
                }
                else if 🔑 == 68 || 🔑 == 130
                {
                    👈𝌮()
                    🌍👉🖥️()
                }
                else if 🔑 == 66 || 🔑 == 129
                {
                    👇𝌮()
                    🌍👉🖥️()
                }
                else if 🔑 == 65 || 🔑 == 128
                {
                    👆𝌮()
                    🌍👉🖥️()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
            case .🎲📱:
                if 🔑 == 10
                {
                    let 🎬 = 📱📱.🏗️()
                    
                    if 🎬 == "👉🎲"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲🌍
                        🌍👉🖥️()
                    }
                    else if 🎬 == "👉💾"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲📱💾
                        🛫📱💾()
                    }
                    else if 🎬 == "🏗️🎲"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲📱🗄️
                        🛫📱🗄️()
                    }
                    else if 🎬 == "🛠️"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲🎛️👅
                        🛫🎛️👅()
                    }
                    else if 🎬 == "👉🚪"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲📱🚪👉
                        📱🚪👉🛫()
                    }
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲🌍
                    🌍👉🖥️()
                }
                else
                {
                    📱📱.👉📚(🔑)
                }
            case .🎲📱💾:
                if 🔑 == 10
                {
                    let 💾 = 📱📱💾.🏗️()
                    let 🎁💾👆 = Int(💾)
                    
                    if var 💾👆 = 🎁💾👆
                    {
                        📨👉🖥️(🫙, 🏗️📝("🛠️💾"), 👍)
                        💾👆 -= 1
                        let 🗂️: [String: Any] = [ "name": 👤🏷️, "face": 👤, "faceColor": 👤🎨, "x": 👤🫵📏, "y": 👤🫵📐, "map": 🌍🌍.👉💾() ]
                        🗄️.👉💾(💾👆, 🗂️)
                    }
                    
                    🎚️ = 🎚️🎚️🎲.🎲🌍
                    🌍👉🖥️()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
                else
                {
                    📱📱💾.👉📚(🔑)
                }
            case .🎲📱🗄️:
                if 🔑 == 10
                {
                    let 🗄️👆 = 📱📱🗄️.🏗️()
                    let 🎁🗄️👆 = Int(🗄️👆)
                    
                    if let 🗄️👆👆 = 🎁🗄️👆
                    {
                        📨👉🖥️(🫙, 🏗️📝("🛠️🏗️🎲"), 👍)
                        🏗️(🗄️👆👆)
                    }
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
                else
                {
                    📱📱🗄️.👉📚(🔑)
                }
            case .🎲🎛️👅:
                if 🔑 == 10
                {
                    🎛️.👅 = 📱🎛️👅.🏗️()
                    🎛️.👉💾()
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
                else
                {
                    📱🎛️👅.👉📚(🔑)
                }
            case .🎲📱🚪👉:
                if 🔑 == 10
                {
                    let 🎬 = 📱🚪👉.🏗️()
                    
                    if 🎬 == "👍"
                    {
                        🚜.🎚️ = 🎚️🎚️.📱
                        🚜.🛫📱()
                    }
                    else if 🎬 == "👎"
                    {
                        🎚️ = 🎚️🎚️🎲.🎲📱
                        📱🛫()
                    }
                }
                else if 🔑 == 27
                {
                    🎚️ = 🎚️🎚️🎲.🎲📱
                    📱🛫()
                }
                else
                {
                    📱🚪👉.👉📚(🔑)
                }
            default:
                👩‍🦽🫙()
        }
    }
    
    static func 👇𝌮()
    {
        if !🌍🌍.🔲🚷(👤🫵📏, 👤🫵📐+1)
        {
            👤🫵📐 += 1
            
            if 👤🫵📐 >= 🌍🌍.🗺️📐
            {
                if 🌍🌍.🔄 == 👍
                {
                    👤🫵📐 = 0
                }
                else
                {
                    👤🫵📐 = 🌍🌍.🗺️📐 - 1
                }
            }
        }
    }
    
    static func 👆𝌮()
    {
        if !🌍🌍.🔲🚷(👤🫵📏, 👤🫵📐-1)
        {
            👤🫵📐 -= 1
            
            if 👤🫵📐 < 0
            {
                if 🌍🌍.🔄 == 👍
                {
                    👤🫵📐 = 🌍🌍.🗺️📐 - 1
                }
                else
                {
                    👤🫵📐 = 0
                }
            }
        }
    }
    
    static func 👉𝌮()
    {
        if !🌍🌍.🔲🚷(👤🫵📏+1, 👤🫵📐)
        {
            👤🫵📏 += 1
            
            if 👤🫵📏 >= 🌍🌍.🗺️📏
            {
                if 🌍🌍.🔄 == 👍
                {
                    👤🫵📏 = 0
                }
                else
                {
                    👤🫵📏 = 🌍🌍.🗺️📏 - 1
                }
            }
        }
    }
    
    static func 👈𝌮()
    {
        if !🌍🌍.🔲🚷(👤🫵📏-1, 👤🫵📐)
        {
            👤🫵📏 -= 1
            
            if 👤🫵📏 < 0
            {
                if 🌍🌍.🔄 == 👍
                {
                    👤🫵📏 = 🌍🌍.🗺️📏 - 1
                }
                else
                {
                    👤🫵📏 = 0
                }
            }
        }
    }
    
    static func 🌍👉🖥️()
    {
        var 📍 = Int(Double(🖥️📏[1])/2.0)
        var 👤📏 = Int(Double(🖥️📏[0])/2.0)
        var 👤📐 = Int(Double(🖥️📏[1])/2.0)
        
        if 🌍🌍.🔄 == 👎
        {
            if 👤🫵📏 < Int(Double(🖥️📏[0])/2.0)
            {
                👤📏 = 👤🫵📏
            }
            else if 👤🫵📏 > 🌍🌍.📏 - Int(Double(🖥️📏[0])/2.0)
            {
                👤📏 = 🌍🌍.📏 - 👤🫵📏
            }
            
            if 👤🫵📐 < Int(Double(🖥️📏[1])/2.0)
            {
                👤📐 = 👤🫵📐
            }
            else if 👤🫵📐 > 🌍🌍.📐 - Int(Double(🖥️📏[1])/2.0)
            {
                👤📐 = 🌍🌍.📐 - 👤🫵📐
            }
            
            📍 = 👤📐
        }
        
        var 🎭🎭: [[String]] = []
        
        for _ in 0..<📍
        {
            🎭🎭.append(🛠️🏴(🖥️📏[0]))
        }
        
        var 👤🎭: [String] = []
        
        for _ in 0..<👤📏
        {
            👤🎭.append("⬛️")
        }
        
        👤🎭.append(👤🎨)
        
        for _ in (👤📏+1)..<🖥️📏[0]
        {
            👤🎭.append("⬛️")
        }
        
        🎭🎭.append(👤🎭)
        
        for _ in (📍+1)..<🖥️📏[1]
        {
            🎭🎭.append(🛠️🏴(🖥️📏[0]))
        }
        
        let 📤 = 🌍🌍.👉🖥️(👤🫵📏, 👤🫵📐, 🎭🎭)
        
        🧽🖥️()
        🧽🎯()
        🖨️(📤, 🫙)
    }
}
