//
//  HomeEngine.swift
//  EmojiRPG
//
//  Created by Suisei killfaeh on 29/12/2024.
//

import Foundation

class 🏠🚜
{
    static let 🏠🌍 = 🎲🌍(40, 48)
    static var 🎞️👆 = 0
    
    static func 🛫()
    {
        🏠🌍.🛫()
    }
    
    static func 👩‍🦽()
    {
        🏠🌍.🎲🎞️👉🖥️()
        
        let 📍📏 = 🖥️📏[1]/2 + 🎞️👆
        
        🧽🖥️()
        🧽🎯()
        
        var 🎭🎭 = [🛠️🏴(🖥️📏[0]), 🛠️🏴(🖥️📏[0]), 🛠️🏴(🖥️📏[0]), 🛠️🏴(🖥️📏[0]), 🛠️🏴(🖥️📏[0]), 🫸🏴🫷(💥📝(👉𝓵𝓮𝓽𝓽𝓮𝓻𝓼(" Emoji  RPG ")), 🖥️📏[0])]
        
        for _ in 🎭🎭.count..<🖥️📏[1]/2
        {
            🎭🎭.append(🛠️🏴(🖥️📏[0]))
        }
        
        🎭🎭.append(🫸🏴🫷(💥📝(🏗️📝("👇🚪")), 🖥️📏[0]))
        
        for _ in 🎭🎭.count..<🖥️📏[1]
        {
            🎭🎭.append(🛠️🏴(🖥️📏[0]))
        }
        
        let 📤 = 🏠🌍.👉🖥️(🖥️📏[0]/2, 📍📏, 🎭🎭)
        🖨️(📤, 🫙)
        🖥️👆()
        
        🎞️👆 += 1
        
        if 🎞️👆 >= 🏠🌍.🗺️📐
        {
            🎞️👆 = 0
        }
    }
}
